app/views/properties/show.html.erb

<% i = 0 %>
<% @property.nearest_stations.each do |x| %>
---
SELECT "nearest_stations".* FROM "nearest_stations" WHERE "nearest_stations"."property_id" = ?  [["property_id", 1]]