app/controllers/nearest_stations_controller.rb

  def index
    @nearest_stations = NearestStation.all
---
SELECT "nearest_stations".* FROM "nearest_stations"

  def create
    @nearest_station = NearestStation.new(nearest_station_params)

    respond_to do |format|
      if @nearest_station.save
---
INSERT INTO "nearest_stations" ("name_of_railway", "station_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name_of_railway", ""], ["station_name", ""], ["created_at", "2021-09-17 06:49:39.837957"], ["updated_at", "2021-09-17 06:49:39.837957"]]

  def destroy
    @nearest_station.destroy
---
DELETE FROM "nearest_stations" WHERE "nearest_stations"."id" = ?  [["id", 1]]

    def set_nearest_station
      @nearest_station = NearestStation.find(params[:id])
---
SELECT  "nearest_stations".* FROM "nearest_stations" WHERE "nearest_stations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]