app/controllers/properties_controller.rb

  def index
    @properties = Property.all
---
SELECT "properties".* FROM "properties"

  def create
    @property = Property.new(property_params)
    respond_to do |format|
      if @property.save
---
INSERT INTO "properties" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2021-09-16 12:06:18.052561"], ["updated_at", "2021-09-16 12:06:18.052561"]]

  def destroy
    @property.destroy
---
DELETE FROM "properties" WHERE "properties"."id" = ?  [["id", 1]]

    def set_property
      @property = Property.find(params[:id])
---
SELECT  "properties".* FROM "properties" WHERE "properties"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]